Revit 2024 API
FabricationSaveJobOptions Constructor (Boolean)
 Constructor
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public FabricationSaveJobOptions(
	bool addHolesForTaps
)
Visual Basic
Public Sub New ( _
	addHolesForTaps As Boolean _
)
Visual C++
public:
FabricationSaveJobOptions(
	bool addHolesForTaps
)
Parameters
addHolesForTaps
Type: System.Boolean
 Set true to have holes for taps on straights added to the created fabrication job.
See Also
FabricationSaveJobOptions Class
FabricationSaveJobOptions Overload
Autodesk.Revit.DB.Fabrication Namespace